Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/product_safety_and_labelling/safety_of_toys_and_products_made_for_children.html.txt.tmx
Source language: en
Languages: ga

source: Safety of toys and products made for children
ga: Sábháilteacht bréagán agus táirgí do leanaí

source: There are specific rules in Ireland and the EU to protect children from playing with unsafe toys
ga: Tá rialacha faoi leith in Éirinn agus san Aontas Eorpach chun leanaí a chosaint ó bhréagáin chontúirteacha agus iad ag déanamh spraoi

source: Specific rules also exist for ensuring the safety of children’s products, for example, baby prams, pushchairs, pacifiers (soothers), cots and clothing
ga: Tá rialacha ar leith freisin le sábháilteacht na dtáirgí leanaí a chinntiú. Mar shampla, pramanna, bugaithe linbh, ciúnaitheoirí, cliabháin agus éadaí

source: Equipment such as swings, slides, pencils and pens are also regulated
ga: Rialaítear áilleagáin agus trealamh cosúil le luascáin, sleamhnáin, pinn luaidhe agus pinn freisin

source: Most of these rules are based on the standards which are developed by the European Committee for standardisation (CEN)
ga: Tá an chuid is mó de na rialacha seo bunaithe ar na caighdeáin atá forbartha ag an gCoiste Eorpach um Chaighdeánú (CEN)

source: The National Standards Authority of Ireland (NSAI) develops standards governing safety, quality, design, performance of specific products for sale in Ireland
ga: Forbraíonn an tÚdarás Náisiúnta Caighdeán na hÉireann (NSAI) caighdeáin a rialaíonn sábháilteacht, cáilíocht, dearadh agus feidhmiú táirgí faoi leith atá ar díol in Éirinn

source: Since 1990, legislation has been in place in Ireland which prohibits the placing of toys on the market unless they meet minimum safety requirements
ga: Ón mbliain 1990 i leith, tá reachtaíocht in Éirinn a chuireann cosc ar bhréagáin a chur ar an margadh mura mbaineann siad na bunriachtanais sábháilteachta amach

source: The European Communities (Safety of Toys) Regulations 2011 (SI 14/2011) (as amended) transposed Directive 2009/48/EC (as amended) on the safety of toys
ga: Thrasuigh Rialacháin na gComhphobal Eorpach (Sábháilteacht Bhréagán), 2011 (I.R. 14/2011) Treoir 2009/48/CE ar shábháilteacht bhréagán

source: The Directive prohibits the placing of toys on the market unless they are safe, and updates the safety requirements
ga: Cuireann an Treoir toirmeasc ar bhréagáin a chur sa mhargadh mura bhfuil siad sábháilte, agus nuashonraíonn sí na riachtanais sábháilteachta

source: It also sets down a requirement to ensure risk assessment is carried out for toys
ga: Anuas air sin, leagtar síos sa Treoir ceanglas lena chinntiú go dtugtar faoi mheasúnú riosca ar bhréagáin

source: Toys placed on the market prior to the making of these Regulations are covered by SI 32/1990 which sets out the safety requirements for toys applicable
ga: Tá bréagáin a chuirtear ar an margadh sula ndearnadh na Rialacháin seo cumhdaithe ag I.R. 32/1990 ina leagtar amach na riachtanais sábháilteachta do bhréagáin atá infheidhme

source: In addition, EU rules state that any product offered for sale in the EU that conforms with certain specific health, safety and environmental protection standards must carry a CE mark
ga: Lena chois sin, maíonn rialacha an Aontais Eorpaigh go gcaithfidh gach táirge a thairgtear ar díol san Aontas Eorpach agus a chomhlíonann caighdeáin chosanta áirithe sláinte, sábháilteachta agus timpeallachta, marc CE a iompar

source: The CE mark is a declaration by the producer that the product conforms to all the applicable EU legislation
ga: Is lipéad le dronuilleog bhán é an marc CE ar tháirge ar a bhfuil na litreacha CE i litreacha dubha

source: Read about the the CE mark
ga: Breathnaigh ar an marc CE

source: A toy is defined in the law as a product intended for children aged under 14 to play with
ga: Is é an sainmhíniú a thugtar ar bhréagán sa dlí ná táirge a mbeartaítear go mbainfidh leanaí faoi 14 bliana d’aois úsáid as chun súgradh leis

source: It does not include products listed in Annex I of Directive 2009/48/EC (pdf)
ga: Ní áirítear táirgí atá liostaithe in Aguisín I de Threoir 2009/48/CE leis (pdf)

source: Equipment children may use (such as sports equipment) that are not toys come under the General Product Safety Directive
ga: Tagann trealamh ar féidir le leanaí úsáid a bhaint as (ar nós trealamh spóirt), nach bréagáin iad, faoi chuimsiú na Treorach um Shábháilteacht Ghinearálta Táirgí

source: General guidelines for buying safe products for children
ga: Treoirlínte ginearálta chun táirgí sábháilte a cheannach do leanaí

source: The following are some basic guidelines when buying safe products and toys
ga: Seo a leanas roinnt treoirlínte ginearálta agus tú ag ceannach táirgí sábháilte agus bréagáin

source: • strong and resilient (i.e., should not break easily)
ga: • láidir agus buanfasach (i.e., níor cheart go mbrisfeadh siad go héasca)

source: • made of materials that do not burn easily
ga: • déanta d’ábhar nach ndófadh ró-éasca

source: • carry the CE mark
ga: • ag iompar mairc CE

source: A child’s product that contains detachable or small parts should be marked as unsuitable for children under 36 months
ga: Ba cheart go gcuirfí in iúl nach bhfuil bréagán feiliúnach do leanaí faoi 36 mí má tá píosaí inscortha istigh leis

source: Any specific hazard that exists should be drawn to your attention
ga: Ba cheart go dtugtar le fios duit má tá aon chontúirt faoi leith ag baint leis

source: Bicycles and go-karts etc
ga: Ba cheart go mbeadh coscáin sásúla ag rothair agus ag cairtíní srl

source: should have adequate brakes and guards for chains and other moving parts
ga: chomh maith le sciath do shlabhraí agus píosaí eile a bhíonn ag bogadh

source: If being used on public roads, bicycles should carry adequate lighting
ga: Má bhaintear úsáid astu ar bhóithre poiblí, ba cheart go mbeadh an soilsiú leormhaith ar rothair

source: Safe use of children’s products
ga: Úsáid shábháilte de tháirgí leanaí

source: It is common sense to ensure that toys are used safely
ga: Is ciallmhar an rud é a dhéanamh cinnte go n-úsáidtear bréagáin go sábháilte

source: Toys with a CE mark indicate that they are safe to use as they were intended to be
ga: Sonraíonn bréagáin leis an marc CE go bhfuil siad sábháilte le húsáid mar ba cheart

source: That is, for the age group they are considered appropriate to
ga: Is é sin, don aoisghrúpa a fheileann don bhréagán

source: For example, a toy suitable for a ten year old can be dangerous if played with by a three year old
ga: Mar shampla, is féidir le bréagán a fheileann do ghasúir atá deich mbliana d’aois a bheith contúirteach do ghasúr atá trí bliana déag d’aois

source: Electrical toys should carry the CE mark to ensure compliance with EU safety standards
ga: Ba cheart go n-iompródh bréagáin leictreacha an marc CE le cinntiú go leantar caighdeáin sábháilteachta an Aontais Eorpaigh

source: No electrical toy should be sold (or given out for free) that exceeds 24 volts
ga: Níor cheart go ndíolfaí aon bhréagán leictreach le níos mó ná 24 volta

source: Electrical items (such as lamps etc.) exist that are intended to appeal to children but these are most definitely NOT toys and should carry a label accordingly worded
ga: (Ní hé seo an scéal iomlán. Níl ann do mhíreanna leictreacha atá dírithe ar leanaí, go háirithe lampaí ach is cinnte NACH bréagáin iad seo agus ba cheart go n-iompródh siad lipéad le foclaíocht dá réir sin.) Ba cheart go mbeadh gach cuid den bhréagán inslithe i gceart chun teagmháil le sreanga beo a sheachaint

source: All parts of the toy should be properly insulated to prevent a risk of contact with live wires. Safety instructions on electrical toys should be clear and precise and should be heeded by consumers
ga: Ní mór do threoracha sábháilteachta ar bhréagáin leictreacha a bheith soiléir agus beacht agus ba cheart go gcloífeadh tomhaltóirí leo

source: Toys and children’s product labelling
ga: Bréagáin agus lipéadú táirgí leanaí

source: The following information should appear on the packaging or the product itself
ga: Ba cheart go bhfeicfeá an t-eolas seo a leanas ar an bpacáistiú nó ar an táirge é féin

source: • Name, trade mark and address of the manufacturer, his agent or importer within the European Union
ga: • Ainm, trádmharc agus seoladh an déantúsóra, a ghníomhaire nó a allmhaireoir laistigh den Aontas Eorpach

source: • Instructions for use, if any
ga: • Treoracha chun é a úsáid, más ann dóibh

source: • Advice on the safe use of the toy (such as ‘unsuitable for children under 36 months’)
ga: • Comhairle ar úsáid shábháilte an bhréagáin (cuir i gcás, ‘mí-oiriúnach do leanaí faoi 36 mí’)

source: The Irish technical standard mark can be placed on the toy along with the CE mark
ga: Is féidir marc caighdeáin teicniúil na hÉireann a chur ar an mbréagán i dteannta an mhairc CE

source: This indicates that the toy complies with all safety regulations
ga: Sonraíonn sé seo go leanann an bréagán na rialacháin sábháilteachta go léir

source: The most common Standard for Toys is called IS EN 71
ga: Is é an Caighdeán do Bhréagáin is coitianta ná IS EN 71

source: If you suspect that a toy is unsafe you should contact the Competition and Consumer Protection Commission(CCPC) who will investigate the matter
ga: Má tá amhras ort go bhfuil bréagán mí-shábháilte, ní mór duit teagmháil a dhéanamh leis an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí (CCPC) a dhéanfaidh fiosrúchán ar an scéal

source: Similarly, if you or a child has been harmed by a toy, you should also contact the CCPC for advice and information
ga: Ar an dul céanna, má dhéanann bréagán dochar duit féin nó do pháiste, ba cheart duit dul i dteagmháil leis an CCPC le haghaidh comhairle agus eolais

source: You can find more information in the CCPC's booklet on toy safety (pdf)
ga: Féadfaidh tú teacht ar bhreis faisnéise i leabhráin an CICT ar shábháilteacht bhréagáin (pdf)
